Revit 2026 API

# KeyBasedTreeEntriesGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<KeyBasedTreeEntry> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of KeyBasedTreeEntry)
```
```cpp
public:
virtual IEnumerator<KeyBasedTreeEntry^>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<KeyBasedTreeEntry>
override GetEnumerator : unit -> IEnumerator<KeyBasedTreeEntry>
```

#### Return Value

IEnumeratorKeyBasedTreeEntryAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

KeyBasedTreeEntries Class

Autodesk.Revit.DB Namespace